// import React from 'react';
import "./Banner.css";
import Bannertwo from "./Bannertwo/Bannertwo";

const Banner = () => {
  return (
    <>
      <div className="banner__section">
        <div className="banner__container container">
          <div className="banner__text">
            <p className="hero-text"><span className="mx"> পুরুষ এবং মহিলাদের জন্য ডেনিম জিন্স</span></p>
            <h1 className="banner-h1" > স্টাইলিশ ন্যারো ফিটিং সেমি <br/>
            স্টিচড ডেনিম জিন্স প্যান্ট.</h1>
            <small className="text-design">সর্বমোট মূল্য:</small>
            <p className="pd-top">
              <del className="simple-color">৳ 750.00</del>  <span className="text-sizing">৳ 550.00</span>
            </p>
            <button className='btn'>অর্ডার করুন <svg  className="icon" xmlns="http://www.w3.org/2000/svg" width="36" height="17" viewBox="0 0 36 17" fill="none">
<path d="M35.1394 8.42963C35.1394 8.94241 34.7165 9.36195 34.1998 9.36195L9.91589 9.36195C9.39912 9.36195 8.9763 8.94241 8.9763 8.42963C8.9763 7.91686 9.39912 7.49731 9.91589 7.49731L34.1998 7.49731C34.7165 7.49731 35.1394 7.91685 35.1394 8.42963Z" fill="#003B60"/>
<path d="M2.32866 8.42963C2.32866 7.91473 1.90798 7.49731 1.38906 7.49731C0.870135 7.49731 0.449463 7.91473 0.449463 8.42963C0.449463 8.94454 0.870135 9.36195 1.38906 9.36195C1.90798 9.36195 2.32866 8.94454 2.32866 8.42963Z" fill="#003B60"/>
<path d="M6.58973 8.42963C6.58973 7.91473 6.16905 7.49731 5.65013 7.49731C5.1312 7.49731 4.71053 7.91473 4.71053 8.42963C4.71053 8.94454 5.1312 9.36195 5.65013 9.36195C6.16905 9.36195 6.58973 8.94454 6.58973 8.42963Z" fill="#003B60"/>
<path d="M35.1394 8.42963C35.1394 8.64407 35.0642 8.8585 34.9139 9.03098L28.6749 16.3171C28.3367 16.7086 27.7447 16.7553 27.3501 16.4243C26.9555 16.0933 26.9085 15.5013 27.2421 15.1097L32.9642 8.42963L27.2421 1.74955C26.9085 1.35797 26.9555 0.770608 27.3501 0.434972C27.7447 0.0993366 28.3367 0.150616 28.6749 0.542191L34.9139 7.82828C35.0642 8.00076 35.1394 8.2152 35.1394 8.42963Z" fill="#003B60"/>
</svg> 
            </button>
            <p className="font-size">
              ঢাকার বাহিরে থেকে অর্ডার করতে চাইলে ১৫০ টাকা <br/> অগ্রিম ডেলিভারি
              পরিশোধ করুন
            </p>
          </div>
          <div className="banner__image">
            <img src="/src/assets/image/hero-imgae.png" alt="" />
          </div>
        </div>
      </div>

      <div className="text-part">
        <p>
          আমাদের এই ডেনিম ফেব্রিক ১০০% কটন টুইল বা স্টেচ টুইল দিয়ে তৈরি হয়। এই
          ফেব্রিক দিয়ে তৈরি হয় শার্ট, জিন্স, ব্যাগ, জ্যাকেটসহ আরও অনেক কিছু। <br/>
          নিয়মিত ব্যবহারের জন্য জিন্স প্যান্টের কোনো তুলনা হয় না। জিন্স তৈরিতে
          ব্যবহার করা হয় ডেনিম কটন যা সম্পূর্ণ সুতি। ছেলেদের জিন্স প্যান্টের দাম
          ও <br/> ডিজাইন দেখে কিনুন বাংলাদেশের অন্যতম সেরা অনলাইন শপ অফুরন্ত থেকে।
        </p>
      </div>
      <Bannertwo/>
    </>
  );
};

export default Banner;
